Python 3.12.7 (tags/v3.12.7:0b05ead, Oct  1 2024, 03:06:41) [MSC v.1941 64 bit (AMD64)] on win32
Type "help", "copyright", "credits" or "license()" for more information.

======================= RESTART: C:/student/김새람/251122.py ======================
\\\\

======================= RESTART: C:/student/김새람/251122.py ======================

======================= RESTART: C:/student/김새람/251122.py ======================
Traceback (most recent call last):
  File "C:/student/김새람/251122.py", line 3, in <module>
    print(a=10)
TypeError: 'a' is an invalid keyword argument for print()

======================= RESTART: C:/student/김새람/251122.py ======================
a=10

======================= RESTART: C:/student/김새람/251122.py ======================
False

======================= RESTART: C:/student/김새람/251122.py ======================
True

======================= RESTART: C:/student/김새람/251122.py ======================
False

======================= RESTART: C:/student/김새람/251122.py ======================
True

======================= RESTART: C:/student/김새람/251122.py ======================
True

======================= RESTART: C:/student/김새람/251122.py ======================
False

======================= RESTART: C:/student/김새람/251122.py ======================
False

======================= RESTART: C:/student/김새람/251122.py ======================
첫 번째 숫자 입력 :2.8
두 번째 숫자 입력 :3.7
num1 > num2 = False
num1 < num2 = True

======================= RESTART: C:/student/김새람/251122.py ======================
첫 번째 숫자 입력 :2.5
두 번째 숫자 입력 :3.3
num1 >= num2 = False
num1 <= num2 = True

======================= RESTART: C:/student/김새람/251122.py ======================
첫 번째 숫자 입력: 4
두 번째 숫자 입력: 4
num1==num2 = True
num1 != num2 = False

======================= RESTART: C:/student/김새람/251122.py ======================
첫 번째 숫자 입력:1
두 번째 숫자 입력: 2
세 번째 숫자 입력: 3
Traceback (most recent call last):
  File "C:/student/김새람/251122.py", line 33, in <module>
    print(type(ascending),type(descending))
NameError: name 'ascending' is not defined

======================= RESTART: C:/student/김새람/251122.py ======================
첫 번째 숫자 입력:1
두 번째 숫자 입력: 2
세 번째 숫자 입력: 3
<class 'bool'> <class 'bool'>

======================= RESTART: C:/student/김새람/251122.py ======================
첫 번째 숫자 입력:1
두 번째 숫자 입력: 2
세 번째 숫자 입력: 3
<class 'bool'> <class 'bool'>
num1<num2<num3 = True
num1>num2>num3 = False

======================= RESTART: C:/student/김새람/251122.py ======================
숫자를 입력해주세요 : 99
True

======================= RESTART: C:/student/김새람/251122.py ======================
숫자를 입력해주세요 : 101
False

100
100


======================= RESTART: C:/student/김새람/251122.py ======================
숫자를 입력해주세요 : 100
False


======================= RESTART: C:/student/김새람/251122.py ======================
숫자를 입력해주세요 : 99
True

======================= RESTART: C:/student/김새람/251122.py ======================
숫자를 입력해주세요 : 55
True

======================= RESTART: C:/student/김새람/251122.py ======================
Traceback (most recent call last):
  File "C:/student/김새람/251122.py", line 45, in <module>
    print(true or false)
NameError: name 'true' is not defined. Did you mean: 'True'?

======================= RESTART: C:/student/김새람/251122.py ======================
true

======================= RESTART: C:/student/김새람/251122.py ======================
True

======================= RESTART: C:/student/김새람/251122.py ======================
False

======================= RESTART: C:/student/김새람/251122.py ======================
False
False

======================= RESTART: C:/student/김새람/251122.py ======================
첫번째 숫자 입력 :10
두번째 숫자 입력: -8
 둘다 양 수? = False
 하나라도 양수 ? = True

======================= RESTART: C:/student/김새람/251122.py ======================
첫번째 숫자 입력 :0
두번째 숫자 입력: 5
num1은 0인가? = True
num2은 0인기? = False

======================= RESTART: C:/student/김새람/251122.py ======================
숫자 하나를 입력하세요 :10
True



======================= RESTART: C:/student/김새람/251122.py ======================
숫자 하나를 입력하세요 :12
False

======================= RESTART: C:/student/김새람/251122.py ======================
숫자 하나를 입력하세요 : 55
True

======================= RESTART: C:/student/김새람/251122.py ======================
숫자 하나를 입력하세요 : 0
True

======================= RESTART: C:/student/김새람/251122.py ======================
첫번째 숫자 입력 :0
두번째 숫자 입력: 0
num1은 0인가? = True
num2은 0인기? = True

======================= RESTART: C:/student/김새람/251122.py ======================
첫번째 숫자 입력 :1
두번째 숫자 입력: 1
num1은 0인가? = False
num2은 0인기? = False

======================= RESTART: C:/student/김새람/251122.py ======================
이 숫자는 15입니다.

======================= RESTART: C:/student/김새람/251122.py ======================

======================= RESTART: C:/student/김새람/251122.py ======================
위 문장은 출력되지 않습니다.

======================= RESTART: C:/student/김새람/251122.py ======================
이 문장에는 is가 있음.

======================= RESTART: C:/student/김새람/251122.py ======================
레벨을 입력해 주세요: 15
현재 레빌은 15입니다.

======================= RESTART: C:/student/김새람/251122.py ======================
레벨을 입력해 주세요: 10
현재 레벨은 15가 아닙니다.

======================= RESTART: C:/student/김새람/251122.py ======================
레벨을 입력해주세요: 12
현재 레벨은 10을 넘습니다.
Traceback (most recent call last):
  File "C:/student/김새람/251122.py", line 91, in <module>
    if leve <20:
NameError: name 'leve' is not defined. Did you mean: 'level'?

======================= RESTART: C:/student/김새람/251122.py ======================
레벨을 입력해주세요: 12
현재 레벨은 10을 넘습니다.
현재 레벨은 20보다 작습니다.
loading,,,

======================= RESTART: C:/student/김새람/251122.py ======================
단어를 입력해주세요:코딩
해당 단어가 포함되어 있습니다.



======================= RESTART: C:/student/김새람/251122.py ======================
단어를 입력해주세요:과학
해당 단어가 포함되어 있지 않습니다.

======================= RESTART: C:/student/김새람/251122.py ======================
단어를 입력해주세요:수학
해당 단어가 포함되어 있지 않습니다.

======================= RESTART: C:/student/김새람/251122.py ======================
레벨을 입력해주세요22
꽃 레벨 입니다.

======================= RESTART: C:/student/김새람/251122.py ======================
몇 월인지 입력해주세요: 11
지금 계절은 {season}입니다.

======================= RESTART: C:/student/김새람/251122.py ======================
몇 월인지 입력해주세요: 11
지금 계절은 가을입니다.

======================= RESTART: C:/student/김새람/251122.py ======================
숫자를 입력해주세요: 10
10은 3이나 5의 배수입니다.

======================= RESTART: C:/student/김새람/251122.py ======================
숫자를 입력해주세요: 14
14는 짝수입니다.

======================= RESTART: C:/student/김새람/251122.py ======================
숫자를 입력해주세요: 3

======================= RESTART: C:/student/김새람/251122.py ======================
현재 온도를 입력해주세요 : 30
날씨 상태 : 더운 날씨


======================= RESTART: C:/student/김새람/251122.py ======================
현재 온도를 입력해주세요 : 25
날씨 상태 : 따듯한 날씨

======================= RESTART: C:/student/김새람/251122.py ======================
현재 온도를 입력해주세요 : 24
날씨 상태 : 시원한 날씨

======================= RESTART: C:/student/김새람/251122.py ======================
문자열을 입력하세요: 이 문장에는 공백이 있을까요?
공백이 포함되어 있습니다.
공백이 포함되어 있지 않습니다.

======================= RESTART: C:/student/김새람/251122.py ======================
문자열을 입력하세요: 이 문장에는 공백이 있을까요?
공백이 포함되어 있습니다.

======================= RESTART: C:/student/김새람/251122.py ======================
문자열을 입력하세요: 이문장에는공백이있을까요?
공백이 포함되어 있지 않습니다.

======================= RESTART: C:/student/김새람/251122.py ======================
나이를 입력해주세요: 30
15세 관람가

Warning (from warnings module):
  File "C:/student/김새람/251122.py", line 156
    grade= '전체 관람가 n\ 12세 관람가'
SyntaxWarning: invalid escape sequence '\ '
>>> 
Warning (from warnings module):
  File "C:/student/김새람/251122.py", line 158
    grade= '전체 관람가 n\ 12세 관람가 n\ 15세 관람가'
SyntaxWarning: invalid escape sequence '\ '
>>> 
======================= RESTART: C:/student/김새람/251122.py ======================
나이를 입력해주세요: 30
전체 관람가 n\ 12세 관람가 n\ 15세 관람가

======================= RESTART: C:/student/김새람/251122.py ======================
나이를 입력해주세요: 30
전체 관람가 
 12세 관람가 
 15세 관람가

======================= RESTART: C:/student/김새람/251122.py ======================
나이를 입력해주세요: 30
전체 관람가 
12세 관람가 
15세 관람가


======================= RESTART: C:/student/김새람/251122.py ======================
나이를 입력해주세요: 14
전체 관람가 
12세 관람가


======================= RESTART: C:/student/김새람/251122.py ======================
나이를 입력해주세요: 8
전체 관람가

======================= RESTART: C:/student/김새람/251122.py ======================
이 숫자는 15가 아닙니다.

======================= RESTART: C:/student/김새람/251122.py ======================
이 숫자는 3입니다.

======================= RESTART: C:/student/김새람/251122.py ======================
사과의 개수를 입력해 주세요: 11
사과가 있습니다.

======================= RESTART: C:/student/김새람/251122.py ======================
사과의 개수를 입력해 주세요: 10
사과는 10개 있습니다.

======================= RESTART: C:/student/김새람/251122.py ======================
문장을 입력하세요 :안녕하세요
공백이 포함되어 있지 않습니다.

======================= RESTART: C:/student/김새람/251122.py ======================
문자를 입력하세요 :^^
특수 문자 입니다.

======================= RESTART: C:/student/김새람/251122.py ======================
키가 150 이상입니다.
키가 160 이상입니다.

======================= RESTART: C:/student/김새람/251122.py ======================
키가 150 이상입니다.

======================= RESTART: C:/student/김새람/251122.py ======================
키를 입력해주세요: 149
키가 150 미만입니다.

======================= RESTART: C:/student/김새람/251122.py ======================
키를 입력해주세요: 166
키가 160 이상입니다.

======================= RESTART: C:/student/김새람/251122.py ======================
첫번째 숫자 :40
두번째 숫자 :12
세번째 숫자 :66
평균이 50 미만이빈다.

======================= RESTART: C:/student/김새람/251122.py ======================
이메일 주소를 입력해주세요: saeram0824
유효 하지 않은 이메일 입니다.

======================= RESTART: C:/student/김새람/251122.py ======================
url을 입력하세요 :https://github.com/Kimsae-ram/-/blob/main/251101.py
https 프로토콜 입니다.

======================= RESTART: C:/student/김새람/251122.py ======================
방향키를 입력해주세요 (w/a/s/d) : ㅈ
잘못 입력하셨습니다.

======================= RESTART: C:/student/김새람/251122.py ======================
방향키를 입력해주세요 (w/a/s/d) : w
위 방향키를 입력하셨습니다.


======================= RESTART: C:/student/김새람/251122.py ======================
방향키를 입력해주세요 (w/a/s/d) : a
좌 방향키를 입력하셨습니다.


======================= RESTART: C:/student/김새람/251122.py ======================
방향키를 입력해주세요 (w/a/s/d) : s
아래 방향키를 입력하셨습니다.


======================= RESTART: C:/student/김새람/251122.py ======================
방향키를 입력해주세요 (w/a/s/d) : j
잘못 입력하셨습니다.

======================= RESTART: C:/student/김새람/251122.py ======================
숫자를 입력해 주세요: 0
number은 0입니다.

======================= RESTART: C:/student/김새람/251122.py ======================
숫자를 입력해 주세요: 0
number은 0입니다.
number은 짝수 입니다.


======================= RESTART: C:/student/김새람/251122.py ======================
숫자를 입력해 주세요: 15
number은 양수입니다.
number은 홀수 입니다.


======================= RESTART: C:/student/김새람/251122.py ======================
숫자를 입력해 주세요: -10
number은 음수입니다.
number은 짝수 입니다.

======================= RESTART: C:/student/김새람/251122.py ======================
숫자를 입력해주세요.101
두자리 숫자가 아닙니다.


======================= RESTART: C:/student/김새람/251122.py ======================
숫자를 입력해주세요.99
두자리 숫자입니다.

======================= RESTART: C:/student/김새람/251122.py ======================
숫자를 입력해주세요.18
이 숫자는 3의 배수입니다.
이 숫자는 6의 배수입니다.
이 숫자는 9의 배수 입니다.


======================= RESTART: C:/student/김새람/251122.py ======================
>>> 숫자를 입력해주세요.12
이 숫자는 3의 배수입니다.
이 숫자는 6의 배수입니다.
>>> 

>>> ======================= RESTART: C:/student/김새람/251122.py ======================
숫자를 입력해주세요.9
이 숫자는 3의 배수입니다.
이 숫자는 9의 배수 입니다.
>>> 
======================= RESTART: C:/student/김새람/251122.py ======================
알파벳을 입력해주세요.a
>>> 
======================= RESTART: C:/student/김새람/251122.py ======================
알파벳을 입력해주세요.ㅁ
대문자 입니다.
>>> 
>>> 

======================= RESTART: C:/student/김새람/251122.py ======================
>>> 알파벳을 입력해주세요.a
소문자 입니다.
>>> 

======================= RESTART: C:/student/김새람/251122.py ======================
>>> 알파벳을 입력해주세요.J
대문자 입니다.
>>> 
======================= RESTART: C:/student/김새람/251122.py ======================
알파벳을 입력해주세요.ㅁ
알파벳이 아닙니다.
